import React from 'react';
import './about.css';
import { useState } from 'react';

export const About = () => {
    // Ваші дані з результатами роботи фонду
    const servicesProvided = 150; // Приклад
    const peopleHelped = 300; // Приклад

    return (
        <div className="container">
            <h1 className="mt-5 mb-4">Про Нас</h1>
            <div className="row">
                <div className="col-md-6">
                    <h2>Наші цілі</h2>
                    <p>Ми - благодійна організація, яка працює з внутрішньо переміщеними особами та військовими, щоб забезпечити їхній комфорт та допомогти їм у переїзді та адаптації. Наша місія полягає у створенні безпечного та підтримуючого середовища для цих груп людей, де кожен може реалізувати свій потенціал та відчути підтримку та зрозуміння.</p>
                    <h2>Волонтери-Герої</h2>
                    <p>Наша команда волонтерів - справжні герої. Вони присвятили свій час та зусилля, щоб допомагати тим, хто потребує допомоги найбільше. Їхня безкорислива робота віддана ідеї допомоги та підтримки говорить про їхню високу моральність та готовність стати на захист слабких та потребуючих.</p>
                </div>
                <div className="col-md-6">
                    <img src="/Kharkiv.jpg.jpg" alt="Ілюстрація" style={{ maxWidth: '100%', height: 'auto', borderRadius: '10px' }} />
                </div>
            </div>
            <h2 className="mt-5">Результати роботи фонду</h2>
            <hr />
            <div className="result-container">
                <div className="result-item">
                    <h3>Послуги надано</h3>
                    <p>{servicesProvided}</p>
                </div>
                <div className="result-item">
                    <h3>Людей отримали допомогу</h3>
                    <p>{peopleHelped}</p>
                </div>
            </div>
            <hr />
            <h2 className="mt-5">Історії</h2>
            <img src="/Flag_of_Ukraine.svg.png" alt="Ілюстрація" style={{ height:'5px', width:'1200px' }} />
            <div className="row">
                <div className="col-md-4 mb-3">
                    <p>Історія 1: Як ми допомогли сім'ї знайти новий дім після евакуації. Спільно з нашою командою волонтерів ми забезпечили їм тимчасове притулок та необхідні речі для початку нового життя.</p>
                </div>
                <div className="col-md-4 mb-3">
                    <p>Історія 2: Як наші волонтери надали підтримку ветеранам у процесі адаптації до мирного життя. Ми створили спеціальні програми та послуги, які допомагають ветеранам знайти роботу, отримати освіту та відновити зв'язки з родиною та суспільством.</p>
                </div>
                <div className="col-md-4 mb-3">
                    <p>Історія 3: Допомога у відновленні дитячого садочка для дітей військових. Ми відремонтували та облаштували сучасний дитячий садок, що дозволить дітям військових отримувати якісну освіту та розвиватися в безпечному середовищі.</p>
                </div>
            </div>
            <h1 className="text-center mt-5 mb-4">Допомагай вже зараз!</h1>
        </div>
    );
}
