import React from 'react';
import './footer.css';
import { useState } from 'react';

export const About = () => {
    return (
        <div className="container">
            <h1 className="mt-5 mb-4">Про Нас</h1>
            <div className="row">
                <div className="col-md-6">
                    <h2>Наша Місія</h2>
                    <p>Ми - благодійна організація, яка працює з внутрішньопереміщеними особами та військовими, щоб забезпечити їхній комфорт та допомогти їм у переїзді та адаптації.</p>
                    <h2>Волонтери-Герої</h2>
                    <p>Наша команда волонтерів - справжні герої. Вони присвятили свій час та зусилля, щоб допомагати тим, хто потребує допомоги найбільше.</p>
                </div>
                <div className="col-md-6">
                    <img src="hero_volunteers.jpg" alt="Волонтери-Герої" className="img-fluid" />
                </div>
            </div>
            <hr />
            <h2 className="mt-4">Благодійні Фонди</h2>
            <p>Ми пишаємося підтримкою, яку надають нам наші благодійні фонди-партнери. Вони допомагають нам забезпечити необхідні ресурси для наших програм і послуг.</p>
            <ul>
                <li>Фонд "Допомога Внутрішньо Переміщеним Особам"</li>
                <li>Фонд "Допомога Військовим"</li>
                {/* Додайте інші фонди та партнерів за потреби */}
            </ul>
            <hr />
            <h2 className="mt-4">Історії</h2>
            <p>Ми віримо в силу маленької допомоги, яка може змінити світ. Ось декілька історій, що ілюструють нашу роботу та вплив нашої допомоги:</p>
            <div className="row">
                <div className="col-md-4 mb-3">
                    <img src="story1.jpg" alt="Історія 1" className="img-fluid" />
                    <p>Історія 1: Як ми допомогли сім'ї знайти новий дім після евакуації.</p>
                </div>
                <div className="col-md-4 mb-3">
                    <img src="story2.jpg" alt="Історія 2" className="img-fluid" />
                    <p>Історія 2: Як наші волонтери надали підтримку ветеранам у процесі адаптації до мирного життя.</p>
                </div>
                <div className="col-md-4 mb-3">
                    <img src="story3.jpg" alt="Історія 3" className="img-fluid" />
                    <p>Історія 3: Допомога у відновленні дитячого садочка для дітей військових.</p>
                </div>
            </div>
        </div>
    );
}
